---
kind: method
id: M:Autodesk.Revit.DB.FilteredWorksetCollector.#ctor(Autodesk.Revit.DB.Document)
source: html/530eff2f-0df7-f35a-9e25-03c72d98a2f4.htm
---
# Autodesk.Revit.DB.FilteredWorksetCollector.#ctor Method

Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.

## Syntax (C#)
```csharp
public FilteredWorksetCollector(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null